# Books (Core)
- Brian Lafferty
- 7.21.22

![png](books_ERD.png)

### Libraries

In [23]:
# imports
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import os

### Connecting MySQL

In [2]:
# connecting MySQL with pymysql
pymysql.install_as_MySQLdb()

In [11]:
# creating connection to MySQL
connection = "mysql+pymysql://root:root@localhost/books"
# creating the engine for the connection
engine = create_engine(connection)

### Loading and saving datasets

In [6]:
# first creating a data folder to store the datasets
os.makedirs('Data/', exist_ok = True)
# double check that the folder was created
os.listdir("Data/")

[]

In [7]:
# loading the user data
users = pd.read_csv('https://docs.google.com/spreadsheets/d/1_c2WTx_eiH8pUM-PTgyt7T4aIl1A3Cp1ukPVPEijoYc/gviz/tq?tqx=out:csv&sheet=users')
# confirming it worked
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
# saving users in data folder
users.to_csv("Data/users.csv", index = False)

In [13]:
# loading books data
books = pd.read_csv('https://docs.google.com/spreadsheets/d/1_D-vW7GXiQfG6D9nzjscgVctKLb6TZl_o8ERNH_tet8/gviz/tq?tqx=out:csv&sheet=books')
# checking it loaded properly
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [16]:
# saving books in data folder
books.to_csv("Data/books.csv", index = False)

In [17]:
# loading suthors data
authors = pd.read_csv('https://docs.google.com/spreadsheets/d/17rABPt5eaIxfhGO75dYCbH-5IloKsAR0HH9V6VC43ZI/gviz/tq?tqx=out:csv&sheet=authors')
# checking it loaded properly
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [18]:
# saving authors in data folder
authors.to_csv("Data/authors.csv", index = False)

In [20]:
# loading favorites data
favorites = pd.read_csv('https://docs.google.com/spreadsheets/d/1SLb3RAhcrZsPWRwR0_njWX7KssUYZ16JFsVqBkSU2GI/gviz/tq?tqx=out:csv&sheet=favorite')
# checking it loaded properly
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [21]:
# saving favorites in data folder
favorites.to_csv("Data/favorites.csv", index = False)

### Creating new database

In [24]:
# creating the database using the connection to MySQL
create_database(connection)

In [25]:
# checking that the database does exist
database_exists(connection)

True

In [26]:
# adding the datasets loaded above to the new database
users.to_sql('users', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

### Querying the new database

In [27]:
# viewing the tables in the database
q = """
SHOW TABLES
"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [28]:
# asking a query about John Doe
q = '''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
(SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name
= "John"));
'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1